"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]},
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""


def main(products):
    total_sum = 0
    total_quantity = 0
    for i in products:
        print(f"Суммарное колличество продаж {i['product']} = {sum(i['items_sold'])}")
        print(f"Среднее колличество продаж {i['product']} = {round(sum(i['items_sold']) / len(i['items_sold']))}")
        total_sum += sum(i['items_sold'])
        total_quantity += len(i['items_sold'])
    print(f"Суммарное колличество продаж всех товаров = {total_sum}")
    print(f"Среднее колличество продаж всех товаров = {round(total_sum / total_quantity)}")


sale = [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]},
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
            ]


if __name__ == "__main__":
    main(sale)
